# Написать программу, которая находит сумму всех
# целых нечетных чисел в диапазоне, указанном пользователем.


user_number = int(input("Please enter your range: "))
user_range = []
user_range.append(user_number)

while i in range(user_number):
    if i == int(i) and i % 2 != 0:
        print(i)
        i+1