#nested fuctions calls = function is called inside the other function
#innermost calls are resolved first


round(abs(float(input("Enter a whole positive number: "))))


Пользователь вводит число. Определить количество цифр в этом числе, посчитать их сумму и среднее арифметическое.
Определить количество нулей в этом числе. Общение с пользователем организовать через меню.

Пользователь вводит с клавиатуры целое шестизначное число. Написать программу, которая определяет,
является ли введенное число — счастливым (Счастливым считается шестизначное число, у которого сумма первых
3 цифр равна сумме вторых трех цифр). Если пользователь ввел не шестизначное число — сообщение об ошибке.

